app/controllers/password_resets_controller.rb

 def create
   @user = User.find_by_email(params[:email])
---
SELECT * FROM `users` WHERE (`users`.`email` = 'chowdhury284@gmail.com') LIMIT 1